service_requests/app/views/service_requests/available.html.erb

    <% @templates.each do |template| %>
        <% current_user.roles_name.each do |rol|%>
---
SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 45]]