service_requests/app/controllers/service_requests_controller.rb

SELECT "service_requests".* FROM "service_requests" WHERE "service_requests"."unique_id" = ?  [["unique_id", 2210566]]
---
  def index
    #Display the service requests that the User has applied for
    @service_requests = ServiceRequest.where(unique_id:current_user.unique_id)

SELECT "service_requests".* FROM "service_requests" WHERE "service_requests"."current_approver" IN (?, ?) AND "service_requests"."unique_id" != ?  [["current_approver", "Faculty Advisor"], ["current_approver", "HoD"], ["unique_id", 22190]]
---
  def display_approvals
    #Display those service requests that require the User's Approval
    @service_requests = ServiceRequest.where(current_approver:current_user.roles_name).where.not(unique_id:current_user.unique_id)

SELECT "service_requests".* FROM "service_requests" WHERE "service_requests"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 1]]
SELECT "service_requests".* FROM "service_requests" WHERE "service_requests"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "approvers".* FROM "approvers" WHERE "approvers"."step" = ? AND "approvers"."template_id" = ? LIMIT ?  [["step", 1], ["template_id", 1], ["LIMIT", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]
SELECT "approvers".* FROM "approvers" WHERE "approvers"."step" = ? AND "approvers"."template_id" = ? LIMIT ?  [["step", 2], ["template_id", 7], ["LIMIT", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."template_id" = ? LIMIT ?  [["template_id", 2], ["LIMIT", 1]]
UPDATE "service_requests" SET "current_step" = ?, "approval_status" = ?, "current_approver" = ?, "updated_at" = ? WHERE "service_requests"."id" = ?  [["current_step", 3], ["approval_status", "Approved"], ["current_approver", nil], ["updated_at", "2024-01-11 19:42:32.815717"], ["id", 7]]
---
  def decision
    @service_request= ServiceRequest.find(params[:id])
    unless (@service_request.unique_id!=current_user.unique_id) & (current_user.roles_name.include?@service_request.current_approver)
      flash[:error]="access denied"
      redirect_to root_path
    end

    if params[:decision]=="Approved"
      @service_request.current_step+=1
      @template=Template.find_by(template_id:@service_request.temp_id)
      next_approver=Approver.find_by(step:@service_request.current_step,template_id:@template.id)
      if next_approver==nil
        @service_request.approval_status="Approved"
      else
        next_approver=next_approver.name
      end

    else
      @service_request.current_step=1
      @template=Template.find_by(template_id:@service_request.temp_id)
      next_approver=Approver.find_by(step:1,template_id:@template.id)
    end

    @service_request.current_approver=next_approver
    @service_request.save

SELECT "applicants".* FROM "applicants" WHERE "applicants"."name" IN (?, ?)  [["name", "Admin"], ["name", "Student"]]
SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 2]]
SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 4]]
SELECT "templates".* FROM "templates" WHERE "templates"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]
---
  def available
    applicants=Applicant.where(name:current_user.roles_name)
    template_ids=[]
    applicants.each do |applicant|
      template_ids.append(applicant.template_ids)
    end
    template_ids= template_ids.to_set
    @templates=Template.where(id:template_ids)

SELECT "templates".* FROM "templates" WHERE "templates"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]
---
  def new
    @template=Template.find_by(template_id: params[:temp_id])

INSERT INTO "service_requests" ("request", "temp_id", "current_step", "applicant_name", "unique_id", "dept", "approval_status", "approval_flow", "field_name", "field_response", "current_approver", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @service_request = ServiceRequest.new(service_request_params)

    respond_to do |format|
      if @service_request.save

UPDATE "service_requests" SET "current_step" = ?, "approval_status" = ?, "field_response" = ?, "current_approver" = ?, "updated_at" = ? WHERE "service_requests"."id" = ?  [["current_step", 1], ["approval_status", "Yet to be Approved"], ["field_response", "Marriage"], ["current_approver", "Faculty Advisor"], ["updated_at", "2024-01-13 14:13:39.202327"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @service_request.update(service_request_params)

DELETE FROM "service_requests" WHERE "service_requests"."id" = ?  [["id", 6]]
---
  def destroy
    @service_request.destroy

SELECT "service_requests".* FROM "service_requests" WHERE "service_requests"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_service_request
      @service_request = ServiceRequest.find(params[:id])