service_requests/app/controllers/service_requests_controller.rb

SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 1]]
---
  def available
    applicants=Applicant.where(name:current_user.roles_name)
    template_ids=[]
    applicants.each do |applicant|

SELECT "templates".* FROM "templates" WHERE "templates"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]
INSERT INTO "service_requests" ("request", "temp_id", "current_step", "applicant_name", "unique_id", "dept", "approval_status", "approval_flow", "field_name", "field_response", "current_approver", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @template=Template.find_by(template_id:params[:service_request][:temp_id])
    #allow only the applicants to apply for the service request
    unless @template.roles_name.intersect?(current_user.roles_name)
      flash[:error]="access denied"
      redirect_to root_path
    end

    @service_request = ServiceRequest.new(service_request_params)

    respond_to do |format|
      if @service_request.save

UPDATE "service_requests" SET "current_step" = ?, "approval_status" = ?, "field_response" = ?, "current_approver" = ?, "updated_at" = ? WHERE "service_requests"."id" = ?
---
  def update
    unless @service_request.approval_status=="Rejected" && @service_request.unique_id==current_user.unique_id
      flash[:error]="access denied"
      redirect_to root_path
    end

    respond_to do |format|
      if @service_request.update(service_request_params)

DELETE FROM "service_requests" WHERE "service_requests"."id" = ?  [["id", 21]]
---
  def destroy
    unless @service_request.unique_id==current_user.unique_id
      flash[:error]="access denied"
      redirect_to root_path
    end
    @service_request.destroy

SELECT "service_requests".* FROM "service_requests" WHERE "service_requests"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
    def set_service_request
      @service_request = ServiceRequest.find(params[:id])

SELECT "templates".* FROM "templates" WHERE "templates"."template_id" = ? LIMIT ?  [["template_id", 1], ["LIMIT", 1]]
---
    def set_template
      @template=Template.find_by(template_id: params[:temp_id])