service_requests/app/controllers/service_requests_controller.rb

  def index
    @service_requests = ServiceRequest.all
---
SELECT "service_requests".* FROM "service_requests"

  def display_approvals
    @service_requests = ServiceRequest.all
---
SELECT "service_requests".* FROM "service_requests"

  def available
    @templates=Template.all
---
SELECT "templates".* FROM "templates" WHERE "templates"."temp_id" = ? LIMIT ?  [["temp_id", "1"], ["LIMIT", 1]]

  def create
    @service_request = ServiceRequest.new(service_request_params)

    respond_to do |format|
      if @service_request.save
---
INSERT INTO "service_requests" ("request", "temp_id", "current_step", "applicant_name", "unique_id", "dept", "approval_status", "approval_flow", "field_name", "field_response", "current_approver", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @service_request.destroy
---
DELETE FROM "service_requests" WHERE "service_requests"."id" = ?  [["id", 2]]

    def set_service_request
      @service_request = ServiceRequest.find(params[:id])
---
SELECT "service_requests".* FROM "service_requests" WHERE "service_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]