service_requests/app/controllers/templates_controller.rb

SELECT "templates".* FROM "templates"
---
  def index
    authorize @current_user , policy_class: UserPolicy
    @templates = Template.all

INSERT INTO "approvers" ("name", "step", "comments", "decision", "template_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Faculty Advisor"], ["step", 1], ["comments", nil], ["decision", nil], ["template_id", 2], ["created_at", "2024-01-09 18:24:31.765817"], ["updated_at", "2024-01-09 18:24:31.765817"]]
INSERT INTO "templates" ("template_id", "name", "applicants", "approval_flow", "field", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    authorize @current_user , policy_class: UserPolicy
    @template = Template.new(template_params)
    i=1
    params[:template][:approval_flow].each do |approver|
      if approver!="_"
        Approver.create(template:@template,name:approver,step:i)

DELETE FROM "templates" WHERE "templates"."id" = ?  [["id", 4]]
---
  def destroy
    authorize @current_user , policy_class: UserPolicy
    @template.destroy

SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_template
      @template = Template.find(params[:id])