service_requests/app/controllers/templates_controller.rb

  def destroy
    authorize @current_user , policy_class: UserPolicy
    @template.destroy
---
DELETE FROM "templates" WHERE "templates"."id" = ?  [["id", 1]]

    def set_template
      @template = Template.find(params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]